LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
/*******************************************************************************
*   Ledger Blue - Non secure firmware
*   (c) 2016 Ledger
*
*  Licensed under the Apache License, Version 2.0 (the "License");
*  you may not use this file except in compliance with the License.
*  You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
*   Unless required by applicable law or agreed to in writing, software
*   distributed under the License is distributed on an "AS IS" BASIS,
*   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
*   See the License for the specific language governing permissions and
*   limitations under the License.
********************************************************************************/


/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_nucleo_bluenrg.h"

#include "stm32l4xx.h"
#include "stm32l4xx_hal.h"

/************************* Miscellaneous Configuration ************************/

/*!< Uncomment the following line if you need to relocate your vector Table in
     Internal SRAM. */
/* #define VECT_TAB_SRAM */
#define VECT_TAB_OFFSET  0x00 /*!< Vector Table base offset field. 
                                   This value must be a multiple of 0x200. */
/******************************************************************************/

#include "osal.h"
#include "sample_service.h"
#include "hci.h"
#include "hal.h"
#include "bluenrg_interface.h"

#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_customhid.h" 

#include <stdio.h>

#include "bagl.h"
#include "seproxyhal.h"
#include "nvm.h"

#include "bootloader.h"


// not used for now
#define THROW(x) for(;;);

#define SYSTICK_MS 8

#define UI_KEYBOARD_BLINK_ON_TOUCH_CYCLES 25

/* Low levels
#define BACKLIGHT_FULL_LEVEL  12
#define BACKLIGHT_DIM_LEVEL   5
*/
#define BACKLIGHT_FULL_LEVEL  70
#define BACKLIGHT_DIM_LEVEL   20

// can process usb in between display requests
//#define ASYNCH_DISPLAY_PROCESSED_EVENT

//#define DEMO_LOGO

//#define TEST_KEYBOARD

const uint32_t CLOCK_SECOND = 1000/SYSTICK_MS;

unsigned int frequency_hz;

SPI_HandleTypeDef hspi;
volatile unsigned short G_io_apdu_length;
USART_HandleTypeDef G_io_se_usart;
#ifndef HAVE_BL
unsigned int G_io_se_link_next_mhz;
unsigned int G_io_se_link_next_etu;
#endif // HAVE_BL

volatile unsigned char G_io_se_powered = 0;
volatile unsigned char G_io_apdu_buffer[260];
extern unsigned char G_io_se_atr[40];
extern unsigned short G_io_se_atr_length;

volatile unsigned int G_io_seproxyhal_ticker_interval_ms;
volatile unsigned int G_io_seproxyhal_ticker_current_ms;
volatile unsigned int G_io_seproxyhal_ticker_enabled;

volatile unsigned int G_screen_brightness_test_ms;
volatile unsigned int G_battery_test_ms;
volatile unsigned int G_watchdog_ms;
volatile unsigned int G_poweroff_ms;
volatile unsigned int G_backlight_autooff_ms;
volatile unsigned int G_backlight_autodim_ms;
#define BATTERY_CHECK_INTERVAL_MS (10*1000)

volatile io_button_t G_io_button;

#ifdef DEBUG_BUTTON_ALWAYS_PUSHED
  #define BUTTON_PRESS_DURATION_BOOT_POWER_OFF         50 // long enough to avoid people being troubled when trying to go bootloader
  #define BUTTON_PRESS_DURATION_BOOT_CTRL_BOOTLOADER   20
  #define BUTTON_PRESS_DURATION_BOOT_SE_RECOVERY       10
  #define BUTTON_PRESS_DURATION_BOOT_POWER_ON          10
  #define BUTTON_PRESS_DURATION_POWER_OFF            1000
  #ifdef DEBUG_BUTTON_FLASHBACK
  #error FLASHBACK not supported with ALWAYS PUSHED
  #endif // DEBUG_BUTTON_FLASHBACK
  #ifdef DEBUG_BUTTON_LINK_DEBUG
  #define BUTTON_PRESS_DURATION_LINK_DEBUG           (BUTTON_PRESS_DURATION_POWER_OFF-2000)
  #endif //DEBUG_BUTTON_LINK_DEBUG
#else // DEBUG_BUTTON_ALWAYS_PUSHED
  #define BUTTON_PRESS_DURATION_BOOT_POWER_OFF       5000 // long enough to avoid people being troubled when trying to go bootloader
  #define BUTTON_PRESS_DURATION_BOOT_CTRL_BOOTLOADER 3000
  #define BUTTON_PRESS_DURATION_BOOT_SE_RECOVERY     1500
  #define BUTTON_PRESS_DURATION_BOOT_POWER_ON         100
  #define BUTTON_PRESS_DURATION_POWER_OFF            2500 // very long press to power off

  #ifdef DEBUG_BUTTON_FLASHBACK
  #define BUTTON_PRESS_DURATION_BOOT_SE_FLASHBACK    4000
  #endif //DEBUG_BUTTON_FLASHBACK

  // the L4 button when pressed a long time switch to a verbose mode
  #ifdef DEBUG_BUTTON_LINK_DEBUG
  #define BUTTON_PRESS_DURATION_LINK_DEBUG           1500
  #endif //DEBUG_BUTTON_LINK_DEBUG

#endif // DEBUG_BUTTON_ALWAYS_PUSHED

volatile unsigned char G_io_apdu_protocol_enabled;
#ifdef HAVE_TOUCHPANEL
volatile struct touch_state_s G_io_touch;
#endif // HAVE_TOUCHPANEL
volatile struct ble_state_s G_io_ble;
volatile struct usb_state_s G_io_usb;
volatile int G_io_seproxyhal_state;
volatile unsigned int G_io_seproxyhal_events;
volatile unsigned char G_io_seproxyhal_buffer[IO_SEPROXYHAL_BUFFER_SIZE_B];

volatile io_unsec_chunk_t G_io_unsec_chunk;

// dummy in case no screen HW declared
__weak void screen_init(unsigned char reinit) {}
__weak void screen_clear(void) {}
__weak void screen_poweroff(void) {}
__weak void screen_update(void) {}
__weak void screen_printf(const char* format,...) {}
__weak void screen_xy(unsigned short x, unsigned short y, unsigned short rotation) {}

const char ESC_DEVICE_NAME[] = "$DEVICENAME";
const char DEVICE_NAME_NA[] = "Device Name not available";

#define SEPROXYHAL_EVENT_TIMEOUT_MS 10000
unsigned int G_seproxyhal_event_timeout_enable;
unsigned int G_seproxyhal_event_timeout;
unsigned char G_seproxyhal_event_timeout_header[3];


void autopoweroff_reset(void) {
  G_poweroff_ms = 0;
}

unsigned int backlight_level;
unsigned int backlight_is_enabled(void) {
  #ifdef BACKLIGHT_AUTOOFF_MS
  return G_backlight_autooff_ms < BACKLIGHT_AUTOOFF_MS;
  #else // if no auto off, the backlight is always on
  return 1;
  #endif //
}

void backlight_dim(void) {
  backlight_level = BACKLIGHT_DIM_LEVEL;
  screen_brightness(BACKLIGHT_DIM_LEVEL);
}

void backlight_enable(unsigned int enable) {
  if (enable) {

#ifdef BACKLIGHT_AUTOOFF_MS
    // don't re-enable, to avoid too much delay (due to printf) and no glitch
    if (backlight_is_enabled() && G_backlight_autodim_ms < BACKLIGHT_AUTODIM_MS) {
      autopoweroff_reset();
      G_backlight_autooff_ms = 0;
      G_backlight_autodim_ms = 0;
      if (backlight_level != BACKLIGHT_FULL_LEVEL) {
        goto full;
      }
      return;
    }
#endif // BACKLIGHT_AUTOOFF_MS

#ifdef BACKLIGHT_AUTODIM_MS
    if (G_backlight_autodim_ms < BACKLIGHT_AUTODIM_MS) {
      autopoweroff_reset();
      G_backlight_autooff_ms = 0;
      G_backlight_autodim_ms = 0;
      if (backlight_level != BACKLIGHT_FULL_LEVEL) {
        goto full;
      }
      return; 
    }
#endif // BACKLIGHT_AUTODIM_MS

