LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
    // DON'T CARE DIMING, REENABLE FULL

    // reenable backlight
    autopoweroff_reset();
    G_backlight_autooff_ms = 0;
    G_backlight_autodim_ms = 0;
  full:
    backlight_level = BACKLIGHT_FULL_LEVEL;
    screen_brightness(BACKLIGHT_FULL_LEVEL);
  }
  else {
    screen_brightness(0);   
  }
}

void pre_harakiri(void) {
  GPIO_InitTypeDef GPIO_InitStruct;
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0); // in case coming from an output state // avoid glitch
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);

  // disable aux power (screen etc)
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, 0);
}


void harakiri(void) {

  __asm volatile("cpsid i");
  
  pre_harakiri();

  /*
  // force button it to 0, to avoid retrig
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  //GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  // OK GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);  
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, 0);

  // 12 ms @ 64mhz
  {volatile unsigned int i = 0x40000; while (i--);}
  */

  // harakiri
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, 0);

  // + reset in case protoboard
  for (;;) {
    NVIC_SystemReset();
  }
}


/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */

char BLE_protocol_send(unsigned char* response_apdu, unsigned short response_apdu_length);


/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */
#ifdef UI_KEYBOARD_BLINK_ON_TOUCH_CYCLES
unsigned char UI_led_remaining_ticks;
#endif // UI_KEYBOARD_BLINK_ON_TOUCH_CYCLES

void UI_led_power(unsigned char powered) {
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  GPIO_InitStruct.Alternate = 0; // GPIO
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, powered&0x1);

  // setup led timeout
  if (powered) {
    UI_led_remaining_ticks = UI_KEYBOARD_BLINK_ON_TOUCH_CYCLES;
  }
}

/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */

void UI_power(unsigned char powered) {
  if (powered) {
    // initialize screen printing
    screen_init(0);
    
#ifdef HAVE_LPTIM
    // Select Peripheral clock for Low Power Timer 1
    RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct;
    RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LPTIM1;
    RCC_PeriphCLKInitStruct.LptimClockSelection = RCC_LPTIM1CLKSOURCE_PCLK;  
    HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  
    /* ## - 1 - Enable LPTIM clock ############################################ */
    __LPTIM1_CLK_ENABLE();
    
    
    // internal clock, prescaler 128
    LPTIM1->CFGR = LPTIM_CFGR_PRESC;
    
    // firstly enable the timer to allow for register modification
    LPTIM1->CR   = LPTIM_CR_ENABLE;
    
    // TSC_ACQUISITION_LATENCY_MS/1000 = 1/(FREQUENCY_HZ/128/ARR)
    // ARR = (TSC_ACQUISITION_LATENCY_MS/1000)*(FREQUENCY_HZ/128)
#if ((frequency_hz/128)*TSC_ACQUISITION_LATENCY_MS)/1000 <= 0
#error invalid ticking interval
#endif 
    LPTIM1->ARR  = ((frequency_hz/128)*TSC_ACQUISITION_LATENCY_MS)/1000;
    // enable compare match on reload value
    LPTIM1->IER  = LPTIM_IER_ARRMIE;
    // clear flag in case already present
    LPTIM1->ICR  = LPTIM_ICR_ARRMCF;
    // start the timer in free run
    LPTIM1->CR  |= LPTIM_CR_CNTSTRT;
    
    /* Enable and set LPTIM Interrupt to the highest priority */
    HAL_NVIC_SetPriority(LPTIM1_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(LPTIM1_IRQn); 
#endif // HAVE_LPTIM
  }
  else {
    screen_poweroff();
    
#ifdef HAVE_LPTIM
    HAL_NVIC_DisableIRQ(LPTIM1_IRQn); 
    __LPTIM1_CLK_DISABLE();
#endif //HAVE_LPTIM
  }
}

// 32 bytes + validation/cancel
#define GETC_BUFFER_SIZE_B 33
volatile struct io_keyboard_s {
  unsigned char action;
  unsigned char getc_buffer[GETC_BUFFER_SIZE_B];
  unsigned int getc_idx;
} G_io_keyboard;

/*
extern void UI_keyboard_validated(void);
extern void UI_keyboard_cancelled(void);
void UI_keyboard_press(unsigned char key) {
  // avoid buffer overflow
  if (G_io_keyboard.getc_idx>=GETC_BUFFER_SIZE_B) {
    G_io_keyboard.action = 1;
    return;
  }
  
  // append the key to the getc buffer
  G_io_keyboard.getc_buffer[G_io_keyboard.getc_idx++] = key;
        
  // DESIGN NOTE: it could have been done in a user called function, but this is already a user called function for the TSC module.
  if (key == KEY_MAPPING_OK) {
    G_io_keyboard.action = 1;
  }
  else if (key == KEY_MAPPING_CANCEL) {
    G_io_keyboard.action = 1;
  } 
}
*/

void KBD_power(unsigned char powered) {
  // reset keyboard state
  G_io_keyboard.action = 0;
  G_io_keyboard.getc_idx = 0;

  //TODO power on the touch screen
}

/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */

void SYSTICK_power(unsigned char powered) {
  if (powered) {
    /*Configure the SysTick to have interrupt in 1ms time basis*/
    // SYSTICK_MS/1000 = 1/(frequency_hz/systickreload)
    // systickreload = (SYSTICK_MS/1000)*(frequency_hz)
    /*
#if ((frequency_hz/1000)*SYSTICK_MS) <= 0 || ((frequency_hz/1000)*SYSTICK_MS) > (1<<24)
#error invalid ticking interval
#endif 
    */
/*
    volatile unsigned int v = frequency_hz;
    v /= 1000;
    v *= SYSTICK_MS;
    HAL_SYSTICK_Config(v);
    */
    HAL_SYSTICK_Config(((frequency_hz/1000UL)*SYSTICK_MS));
  }  
  else {
    SysTick->CTRL = 0;
  }
}

/* ==========================================================================================
 * ==========================================================================================
 * ========================================================================================== 
 */


#ifdef HAVE_BLE
/**
  * @brief  PendSV_Handler This function handles PendSVC exception.
  * @param  None
  * @retval None
  */
void PendSV_Handler(void)
{
  // process bluetooth IO state machin more prioritized than nomal process (main)
  BlueNRG_PENDSV_Process();
}
#endif // HAVE_BLE

/**
* @brief This function handles USB OTG FS global interrupt.
*/
extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
void OTG_FS_IRQHandler(void)
{
  /* USER CODE BEGIN OTG_FS_IRQn 0 */

  /* USER CODE END OTG_FS_IRQn 0 */
  HAL_PCD_IRQHandler(&hpcd_USB_OTG_FS);
  /* USER CODE BEGIN OTG_FS_IRQn 1 */

  /* USER CODE END OTG_FS_IRQn 1 */
}

/**
  * @brief  SysTick_Handler This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
extern __IO uint32_t uwTick;
int brightness;
void SysTick_Handler(void)
{
  // increment the systick of the number of milliseconds elapsed since previous tick
  // NOTE: HAX of Hal_IncTick, to support all HAl_Delay callers (shall be avoided in the end)
  // TODO: remove me to detect HAL_Delay loops
  uwTick+=SYSTICK_MS;
  
