LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
  // update the ticker event
  if (G_io_seproxyhal_ticker_enabled) {
    G_io_seproxyhal_ticker_current_ms += SYSTICK_MS;
    if (G_io_seproxyhal_ticker_current_ms >= G_io_seproxyhal_ticker_interval_ms) {
      __asm volatile ("cpsid i");
      G_io_seproxyhal_events |= SEPROXYHAL_EVENT_TICKER;
      G_io_seproxyhal_ticker_current_ms = 0;
      __asm volatile ("cpsie i");
    }
  }

  if (G_io_button.pressed) {
    // compute total press duration
    G_io_button.duration_ms += SYSTICK_MS;

/* temporarily disable for bolos ux on nano
    // prepare to generate a new button event
    G_io_button.next_event_ms += SYSTICK_MS;
    if (G_io_button.next_event_ms >= SEPROXYHAL_TAG_BUTTON_PUSH_INTERVAL_MS) {
      __asm volatile ("cpsid i");
      G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BUTTON;
      G_io_button.next_event_ms = 0;
      __asm volatile ("cpsie i");
    }
*/

    if (G_io_button.displayed_mode & MODE_BOOT) {
      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_BOOT_SE_RECOVERY && ! (G_io_button.displayed_mode & MODE_SE_RECOVERY)) {
        G_io_button.displayed_mode |= MODE_SE_RECOVERY;
        screen_printf("Secure bootloader\n");
      }

      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_BOOT_CTRL_BOOTLOADER && ! (G_io_button.displayed_mode & MODE_MCU_BOOTLOADER)) {
        G_io_button.displayed_mode |= MODE_MCU_BOOTLOADER;
        screen_printf("Bootloader\n");
      }

#ifdef DEBUG_BUTTON_FLASHBACK
      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_BOOT_SE_FLASHBACK && ! (G_io_button.displayed_mode & MODE_SE_FLASHBACK)) {
        G_io_button.displayed_mode |= MODE_SE_FLASHBACK;
        screen_printf("SE flashback\n");
      }
#endif // DEBUG_BUTTON_FLASHBACK

      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_BOOT_POWER_OFF && ! (G_io_button.displayed_mode & MODE_POWER_OFF)) {
        G_io_button.displayed_mode |= MODE_POWER_OFF;
        PRINTF("Mode power off\n");

  #ifndef DEBUG_BUTTON_ALWAYS_PUSHED
        // disable aux power (screen etc) for haptic return
        pre_harakiri();

        // TODO engage watchdog
  #endif // DEBUG_BUTTON_ALWAYS_PUSHED
      }
    }
    else {
#ifdef DEBUG_BUTTON_LINK_DEBUG
      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_LINK_DEBUG && ! (G_io_button.displayed_mode & MODE_LINK_DEBUG)) {
        G_io_button.link_debug++;
        G_io_button.displayed_mode |= MODE_LINK_DEBUG;
        screen_printf("SE link debug level %d\n", G_io_button.link_debug);
      }
#endif // DEBUG_BUTTON_LINK_DEBUG

      if (G_io_button.duration_ms > BUTTON_PRESS_DURATION_POWER_OFF && ! (G_io_button.displayed_mode & MODE_BOOT) && ! (G_io_button.displayed_mode & MODE_POWER_OFF)) {
        G_io_button.displayed_mode |= MODE_POWER_OFF;
        PRINTF("Mode power off\n");

  #ifndef DEBUG_BUTTON_ALWAYS_PUSHED
        // disable aux power (screen etc) for haptic return
        pre_harakiri();

        // TODO engage watchdog
  #endif // DEBUG_BUTTON_ALWAYS_PUSHED
      }
    }

  }

  if (G_seproxyhal_event_timeout_enable) {
    G_seproxyhal_event_timeout += SYSTICK_MS;
    #ifdef DEBUG_BUTTON_LINK_DEBUG
    if (G_io_button.link_debug && G_seproxyhal_event_timeout > SEPROXYHAL_EVENT_TIMEOUT_MS && G_seproxyhal_event_timeout_enable == 1) {
      G_seproxyhal_event_timeout_enable = 2;
      screen_printf("Timeout waiting status for event: %.*H...\n", 3, G_seproxyhal_event_timeout_header);
    }
    #endif // DEBUG_BUTTON_LINK_DEBUG
  }


  // battery level check (only when not button pressed, to avoid problem during boot)
  if (uwTick > G_battery_test_ms 
      && G_io_apdu_protocol_enabled // only display battery over bootloader
#ifdef HAVE_DRAW
    && G_battery_test_ms != -1 
#endif // HAVE_DRAW
    && !G_io_button.pressed) {
    unsigned char battery_text [64];
    G_battery_test_ms = uwTick + BATTERY_CHECK_INTERVAL_MS;

    // perform measurement
    strcpy(battery_text, "Battery level: ");
    unsigned int b = battery_get_level_mv();
    battery_text[15] = (b/1000)%10 + '0';
    battery_text[15+1] = '.';
    battery_text[15+2] = (b/100)%10 + '0';
    battery_text[15+3] = (b/10)%10 + '0';
    battery_text[15+4] = 'V';
    battery_text[15+5] = '\0';
    strcat(battery_text, ", Version: " VERSION);

    bagl_component_t batt_comp = 
    {BAGL_LABEL                          , 0x00,   0, 438, 320,  14, 0, 0, BAGL_FILL, 0x999999, 0xF9F9F9, BAGL_FONT_OPEN_SANS_LIGHT_13px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0 };

    bagl_draw_with_context(&batt_comp, battery_text, strlen(battery_text), BAGL_ENCODING_LATIN1);

    //PRINTF("%d.%03d V %s\n", b/1000, b%1000, (b < 3700 ? "VERY LOW BATT !!":(b < 3900? "low battery, charge me !":"")) );
  }

#ifdef WATCHDOG_POWEROFF_MS
  G_poweroff_ms += SYSTICK_MS;
  if (G_poweroff_ms > WATCHDOG_POWEROFF_MS) {
    harakiri();
  }
#endif 

#ifdef BACKLIGHT_AUTODIM_MS
  // auto dim off the backlight when no activity after some times
  if (G_backlight_autodim_ms < BACKLIGHT_AUTODIM_MS) {
    G_backlight_autodim_ms += SYSTICK_MS;

    if (G_backlight_autodim_ms >= BACKLIGHT_AUTODIM_MS) {
      backlight_dim();
    }
  }
#endif // BACKLIGHT_AUTODIM_MS

#ifdef BACKLIGHT_AUTOOFF_MS
  // auto dim off the backlight when no activity after some times
  if (G_backlight_autooff_ms < BACKLIGHT_AUTOOFF_MS) {
    G_backlight_autooff_ms += SYSTICK_MS;

    if (G_backlight_autooff_ms >= BACKLIGHT_AUTOOFF_MS) {
      backlight_enable(0);
    }
  }
#endif // BACKLIGHT_AUTOOFF_MS
}

/**
 * Handle the button interrupt
 */
void EXTI2_IRQHandler(void) {
  // detect BLE request to read
  if (__HAL_GPIO_EXTI_GET_FLAG(GPIO_PIN_2)) {
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_2);
    if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_2)) {
      __asm volatile ("cpsid i");
      G_io_button.duration_ms = 0;
      G_io_button.pressed |= 1;
      G_io_button.next_event_ms = 0;
      G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BUTTON;
      __asm volatile ("cpsie i");
      // ensure backlight is enabled
      backlight_enable(1);
    }
    else if (G_io_button.pressed) {
#ifndef DEBUG_BUTTON_ALWAYS_PUSHED
      if (G_io_button.displayed_mode & MODE_BOOT) {
        // power off safe guard
        if (G_io_button.duration_ms >= BUTTON_PRESS_DURATION_BOOT_POWER_OFF) {
          harakiri();
        }
      }
      else {
        // power off safe guard
        if (G_io_button.duration_ms >= BUTTON_PRESS_DURATION_POWER_OFF) {
          harakiri();
        }
      }
#endif // DEBUG_BUTTON_ALWAYS_PUSHED

