LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
      __asm volatile ("cpsid i");
      G_io_button.pressed &= ~1;
      // G_io_button.next_event_ms = 0; // don't !! to avoid killing the interval computation with another button
      G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BUTTON;
      __asm volatile ("cpsie i");
    }
  }
}

#ifdef HAVE_BLE
/**
  *
  *
  */
void BNRG_SPI_EXTI_IRQHandler(void) {
  // detect BLE request to read
  if (BNRG_SPI_EXTI_PORT->IDR & BNRG_SPI_EXTI_PIN) {
    //Hal_IRQ_Serial();
    BlueNRG_EXTI_Process();
  }
  // done after to avoid glitch interpretation during read command start
  __HAL_GPIO_EXTI_CLEAR_IT(BNRG_SPI_EXTI_PIN);
}
#endif // HAVE_BLE

#include "bagl.h"


/* Private function prototypes -----------------------------------------------*/
void User_Process(void);

void clock_low(void) {
  //RCC->ICSCR = ((RCC->ICSCR) & 0xFFFF1FFF) | 0x00000000;
}

void clock_high(void) {

  // MSI
  //RCC->ICSCR = ((RCC->ICSCR) & 0xFFFF1FFF) | (MSIRANGE<<13);
  // HSI
}

#include "stm32l4xx_hal_adc.h"
unsigned int battery_get_level_mv(void) {
  GPIO_InitTypeDef GPIO_InitStruct;
  volatile unsigned int mv;
  volatile unsigned int vdd;

  mv = 0;

  // power up the measurment bridge
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  // drive current low
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, 0);

#define BAT_ADC_DELAY_MS 10
  volatile unsigned int i = ((frequency_hz/1000)*BAT_ADC_DELAY_MS)/1000/3;
  while(i--);

  GPIO_InitStruct.Pin = GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG_ADC_CONTROL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  // compute Vdd value against VRefInt (optional, could use the LDO output 3.0v)
  vdd = 3100;

  // ADC aquisition
  ADC_HandleTypeDef             AdcHandle;
  ADC_ChannelConfTypeDef        sConfig;
  memset(&AdcHandle, 0, sizeof(AdcHandle));
  memset(&sConfig, 0, sizeof(sConfig));
  
  __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_SYSCLK);
  __HAL_RCC_ADC_CLK_ENABLE();
  AdcHandle.Instance                   = ADC1;

  AdcHandle.Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV1;          /* Asynchronous clock mode, input ADC clock not divided */
  AdcHandle.Init.Resolution            = ADC_RESOLUTION_12B;             /* 12-bit resolution for converted data */
  AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;           /* Right-alignment for converted data */
  AdcHandle.Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  AdcHandle.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;           /* EOC flag picked-up to indicate conversion end */
  AdcHandle.Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
  AdcHandle.Init.ContinuousConvMode    = ENABLE;                        /* Continuous mode enabled (automatic conversion restart after each conversion) */
  AdcHandle.Init.NbrOfConversion       = 1;                             /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.NbrOfDiscConversion   = 1;                             /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */
  AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because software trigger chosen */
  AdcHandle.Init.DMAContinuousRequests = DISABLE;                       /* DMA one-shot mode selected (not applied to this example) */
  AdcHandle.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */
  AdcHandle.Init.OversamplingMode      = ENABLE;                        /* Oversampling enabled */
  AdcHandle.Init.Oversampling.Ratio                 = ADC_OVERSAMPLING_RATIO_256;    /* Oversampling ratio */
  AdcHandle.Init.Oversampling.RightBitShift         = ADC_RIGHTBITSHIFT_4;         /* Right shift of the oversampled summation */
  AdcHandle.Init.Oversampling.TriggeredMode         = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;         /* Specifies whether or not a trigger is needed for each sample */
  AdcHandle.Init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE; /* Specifies whether or not the oversampling buffer is maintained during injection sequence */    
 
  /* Initialize ADC peripheral according to the passed parameters */
  if (HAL_ADC_Init(&AdcHandle) != HAL_OK)
  {
    return 0xFFFFFFFE;
  }
  
  /* ### - 2 - Start calibration ############################################ */
  if (HAL_ADCEx_Calibration_Start(&AdcHandle, ADC_SINGLE_ENDED) != HAL_OK)
  {
    return 0xFFFFFFFD;
  }
  
  /* ### - 3 - Channel configuration ######################################## */
  /* Select Channel 0 to be converted */
  sConfig.Channel      = ADC_CHANNEL_14 /*PC5*/;
  sConfig.Rank         = ADC_REGULAR_RANK_1;          /* Rank of sampled channel number ADCx_CHANNEL */
  sConfig.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;    /* Sampling time (number of clock cycles unit) */
  sConfig.SingleDiff   = ADC_SINGLE_ENDED;            /* Single-ended input channel */
  sConfig.OffsetNumber = ADC_OFFSET_NONE;             /* No offset subtraction */ 
  sConfig.Offset = 0;                                 /* Parameter discarded because offset correction is disabled */
  if (HAL_ADC_ConfigChannel(&AdcHandle, &sConfig) != HAL_OK)
  {
    return 0xFFFFFFFC;
  }
  
 /*##- 4- Start the conversion process #######################################*/  
  if(HAL_ADC_Start(&AdcHandle) != HAL_OK) {
    return 0xFFFFFFFB;
  }

  // wait for conversion to end
  HAL_ADC_PollForConversion(&AdcHandle, 10000);
  
  /* Check if the continous conversion of regular channel is finished */
  if(HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_REG_EOC)
  {
    mv = HAL_ADC_GetValue(&AdcHandle);
    //screen_printf(" %d ", mv);
    // mv is computed on a 1/2 voltage divider
    // range of the adc if [0 ; (65536-16)]
    mv = 2*mv *vdd/((1<<16)-16);

