LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
    /*
    // VREFINT is directly converted to obtain the effective vcc value
    if (io->adc_channel == 17) {
      #define VREFINT_CAL (*(uint16_t*)0x1FF80078)
      uint32_t val = 3000UL * (VREFINT_CAL<<4) / (value);
      //uint32_t val = (VREFINT_CAL) * (value) / 1200;
      //uint32_t val = 3000000UL / 1224UL * (value) / (VREFINT_CAL); // 1.224v for the vref gap
      value = val;
    }
    */
  }

  // stop the ADC
  HAL_ADC_Stop(&AdcHandle);

  HAL_ADC_DeInit(&AdcHandle);

  __HAL_RCC_ADC_FORCE_RESET();
  __HAL_RCC_ADC_RELEASE_RESET();
  __HAL_RCC_ADC_CLK_DISABLE();
  // low power (high impedance)
  GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  return mv;
}


/**
 * @brief  Main function to show how to use the BlueNRG Bluetooth Low Energy 
 *          shield to exchange data between two Nucleo baords with their
 *          respective BlueNRG shields.
 *          One board will act as Server-Peripheral and the other as 
 *          Client-Central.
 *          After connection has been established, by pressing the USER button
 *          on one board, the LD2 LED on the other one gets toggled and
 *          viceversa.
 *          The communication is done using a vendor specific profile.
 * @param  None
 * @retval None
 */

USBD_HandleTypeDef USBD_Device;
PCD_HandleTypeDef hpcd_USB_OTG_FS;


void clock_config(void) {
  // setup clock for USB peripheral
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  /*
  memset(&RCC_OscInitStruct, 0, sizeof(RCC_OscInitStruct));
  memset(&RCC_ClkInitStruct, 0, sizeof(RCC_ClkInitStruct));
  memset(&PeriphClkInit, 0, sizeof(PeriphClkInit));
  */

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1; // 1 to 8
  RCC_OscInitStruct.PLL.PLLN = 24; // 8 to 86 // equals MBit of SPI1 for screen
  //RCC_OscInitStruct.PLL.PLLN = 32; // 8 to 86 // equals MBit of SPI1 for screen
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7; // SAI1/SAI2
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2; // 48M1CLK
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV4; // SYSCLK
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  // compute systick clock at once
  frequency_hz = 8000000*RCC_OscInitStruct.PLL.PLLN/RCC_OscInitStruct.PLL.PLLR;

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USB;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLLSAI1;
  PeriphClkInit.PLLSAI1.PLLSAI1N = 12;
  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK;
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

  // configure USART1 (se link) clock source
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_SYSCLK;
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);
}


#ifdef HAVE_BL
#define CLA 0xE0

#define INS_SECUINS 0
#define INS_GET_VERSION 0x01
#define INS_RESET 2

#define INS_VALIDATE_TARGET_ID 4

// entirely replied (length of Lc)
#define INS_ECHO 0xFF

// graphic debug for NBI
#define INS_DRAW_BMP4BPP          0x40
#define INS_DRAW_BMP4BPP_CONTINUE 0x41

// 0xE0 0xFE 0x00 0x00 0x06 <U4BE(@)> <U2BE(len)>
#define INS_DUMP 0xFE
#define INS_MCU_CMD 0xFD

#define SECUREINS_SELECT_SEGMENT 5
#define SECUREINS_LOAD 6
#define SECUREINS_FLUSH 7
#define SECUREINS_CRC 8
// start at given address (app main)
#define SECUREINS_BOOT 9
#define SECUREINS_TESTBOOT 0xA
#define SECUREINS_ERASE_BOOT 0xE

// within the data field
#define APDU_OFF_CLA 0
#define APDU_OFF_INS 1
#define APDU_OFF_LC 4  
#define APDU_OFF_SECINS 5

#define STATE_ID     0xFF00
#define STATE_UNAUTH 0xEE11
#define STATE_AUTH   0xDD22 

#define U2(hi,lo) ((((hi)&0xFF)<<8) | ((lo)&0xFF))
#define U4(hi3, hi2, lo1,lo0) ((((hi3)&0xFF)<<24) | (((hi2)&0xFF)<<16) | (((lo1)&0xFF)<<8) | ((lo0)&0xFF))
#define U2BE(buf, off) ((((buf)[off]&0xFF)<<8) | ((buf)[off+1]&0xFF) )
#define U4BE(buf, off) ((U2BE(buf, off)<<16) | (U2BE(buf, off+2)&0xFFFF))
#define MIN(x,y) ((x)<(y)?(x):(y))
#define MAX(x,y) ((x)>(y)?(x):(y))
#define os_memmove memmove
#define os_memset memset

// --------------------------------------------------------------------------
// -
// --------------------------------------------------------------------------

static unsigned short const cx_ccitt[] = {
  0x0000, 0x1021, 0x2042, 0x3063, 0x4084, 0x50a5, 0x60c6, 0x70e7, 
  0x8108, 0x9129, 0xa14a, 0xb16b, 0xc18c, 0xd1ad, 0xe1ce, 0xf1ef, 
  0x1231, 0x0210, 0x3273, 0x2252, 0x52b5, 0x4294, 0x72f7, 0x62d6, 
  0x9339, 0x8318, 0xb37b, 0xa35a, 0xd3bd, 0xc39c, 0xf3ff, 0xe3de, 
  0x2462, 0x3443, 0x0420, 0x1401, 0x64e6, 0x74c7, 0x44a4, 0x5485, 
  0xa56a, 0xb54b, 0x8528, 0x9509, 0xe5ee, 0xf5cf, 0xc5ac, 0xd58d, 
  0x3653, 0x2672, 0x1611, 0x0630, 0x76d7, 0x66f6, 0x5695, 0x46b4, 
  0xb75b, 0xa77a, 0x9719, 0x8738, 0xf7df, 0xe7fe, 0xd79d, 0xc7bc, 
  0x48c4, 0x58e5, 0x6886, 0x78a7, 0x0840, 0x1861, 0x2802, 0x3823, 
  0xc9cc, 0xd9ed, 0xe98e, 0xf9af, 0x8948, 0x9969, 0xa90a, 0xb92b, 
  0x5af5, 0x4ad4, 0x7ab7, 0x6a96, 0x1a71, 0x0a50, 0x3a33, 0x2a12, 
  0xdbfd, 0xcbdc, 0xfbbf, 0xeb9e, 0x9b79, 0x8b58, 0xbb3b, 0xab1a, 
  0x6ca6, 0x7c87, 0x4ce4, 0x5cc5, 0x2c22, 0x3c03, 0x0c60, 0x1c41, 
  0xedae, 0xfd8f, 0xcdec, 0xddcd, 0xad2a, 0xbd0b, 0x8d68, 0x9d49, 
  0x7e97, 0x6eb6, 0x5ed5, 0x4ef4, 0x3e13, 0x2e32, 0x1e51, 0x0e70, 
  0xff9f, 0xefbe, 0xdfdd, 0xcffc, 0xbf1b, 0xaf3a, 0x9f59, 0x8f78, 
  0x9188, 0x81a9, 0xb1ca, 0xa1eb, 0xd10c, 0xc12d, 0xf14e, 0xe16f, 
  0x1080, 0x00a1, 0x30c2, 0x20e3, 0x5004, 0x4025, 0x7046, 0x6067, 
  0x83b9, 0x9398, 0xa3fb, 0xb3da, 0xc33d, 0xd31c, 0xe37f, 0xf35e, 
  0x02b1, 0x1290, 0x22f3, 0x32d2, 0x4235, 0x5214, 0x6277, 0x7256, 
  0xb5ea, 0xa5cb, 0x95a8, 0x8589, 0xf56e, 0xe54f, 0xd52c, 0xc50d, 
  0x34e2, 0x24c3, 0x14a0, 0x0481, 0x7466, 0x6447, 0x5424, 0x4405, 
  0xa7db, 0xb7fa, 0x8799, 0x97b8, 0xe75f, 0xf77e, 0xc71d, 0xd73c, 
  0x26d3, 0x36f2, 0x0691, 0x16b0, 0x6657, 0x7676, 0x4615, 0x5634, 
  0xd94c, 0xc96d, 0xf90e, 0xe92f, 0x99c8, 0x89e9, 0xb98a, 0xa9ab, 
  0x5844, 0x4865, 0x7806, 0x6827, 0x18c0, 0x08e1, 0x3882, 0x28a3, 
  0xcb7d, 0xdb5c, 0xeb3f, 0xfb1e, 0x8bf9, 0x9bd8, 0xabbb, 0xbb9a, 
  0x4a75, 0x5a54, 0x6a37, 0x7a16, 0x0af1, 0x1ad0, 0x2ab3, 0x3a92, 
  0xfd2e, 0xed0f, 0xdd6c, 0xcd4d, 0xbdaa, 0xad8b, 0x9de8, 0x8dc9, 
  0x7c26, 0x6c07, 0x5c64, 0x4c45, 0x3ca2, 0x2c83, 0x1ce0, 0x0cc1, 
  0xef1f, 0xff3e, 0xcf5d, 0xdf7c, 0xaf9b, 0xbfba, 0x8fd9, 0x9ff8, 
  0x6e17, 0x7e36, 0x4e55, 0x5e74, 0x2e93, 0x3eb2, 0x0ed1, 0x1ef0,
};


// --------------------------------------------------------------------------
// -
// --------------------------------------------------------------------------

unsigned short cx_crc16_update(unsigned short crc, void const *buf, int len) {
  int i;
  unsigned char b;

  for (i = 0; i<len; i++) {
    b = ((unsigned char const *)buf)[i];
    b = b ^ (crc >> 8);
    crc = cx_ccitt[b] ^ (crc << 8);
  }
  return crc;
}


unsigned short  cx_crc16(void const *buf, int len) {
  return cx_crc16_update(0xFFFF, buf, len);
}


void bootloader_erase_appconf(void) {
  // erase the whole page
  nvm_write(&N_bootloader_configuration, NULL, NVM_PAGE_SIZE_B);
  // ensure flushed to nvram
  nvm_write_flush();
}

extern unsigned int _text;
extern unsigned int _eloadedtext;
extern unsigned int _data;
extern unsigned int _edata;

void bootloader_apdu_interp(void) {
  volatile unsigned short rx = 0;
  volatile unsigned short tx = 0;
  volatile unsigned char iv[8];
  volatile unsigned char flags;
  volatile unsigned int load_address;
  volatile unsigned short state = STATE_ID;
  // reset variables to avoid subtil attack after returning from the loaded app
  rx = 0;
  tx = 0;
  state = STATE_ID;
  load_address = 0;
  flags = 0;
  memset(iv, 0, sizeof(iv));

  io_usb_hid_init();

  nvm_write_init();

