LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
  // DESIGN NOTE: the bootloader ignores the way APDU are fetched. The only goal is to retrieve APDU.
  // When APDU are to be fetched from multiple IOs, like NFC+USB+BLE, make sure the io_event is called with a 
  // switch event, before the apdu is replied to the bootloader. This avoid APDU injection faults.
        
  for (;;) {

    unsigned short sw;

    // process screen touch
    while ((rx = io_exchange(CHANNEL_APDU|flags, 0)) == 0 ) {

      screen_update_touch_event();

      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BUTTON) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_BUTTON;

        backlight_enable(1);
      }

      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_RELEASE) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_RELEASE;

        if (backlight_is_enabled()) {
          // reset power off, a new command has been received
          backlight_enable(1);
        }

        display_l4_mode_touch();
      }
    }

    // reset power off, a new command has been received
    backlight_enable(1);

    tx = 0; // ensure no race in catch_other if io_exchange throws an error

    // no apdu received, well, reset the session, and reset the bootloader configuration
    if (rx == 0) {
      sw = 0x6982; goto error;
    }

    if (G_io_apdu_buffer[APDU_OFF_CLA] != CLA) {
      sw = 0x6E00; goto error;
    }

    // unauthenticated instruction
    switch (G_io_apdu_buffer[APDU_OFF_INS]) {
      case INS_GET_VERSION:
        tx = sizeof(VERSION);
        G_io_apdu_buffer[0] = CONFIG_TARGET_ID>>24;
        G_io_apdu_buffer[1] = CONFIG_TARGET_ID>>16;
        G_io_apdu_buffer[2] = CONFIG_TARGET_ID>>8;
        G_io_apdu_buffer[3] = CONFIG_TARGET_ID;
        G_io_apdu_buffer[4] = sizeof(VERSION);
        memcpy(G_io_apdu_buffer + 5, VERSION, sizeof(VERSION));
        sw = 0x9000; goto error;


      case INS_VALIDATE_TARGET_ID:
        if (U4BE(G_io_apdu_buffer, 5) == CONFIG_TARGET_ID) {
          state = STATE_UNAUTH;
          sw = 0x9000; goto error;
        }
        else {
          // id not valid
          state = STATE_ID;
          sw = 0x6A84; goto error;
        }
        break;

#ifdef HAVE_DRAW
      case INS_DRAW_BMP4BPP: {
        G_battery_test_ms = -1; // avoid disturbance during graphic tests
        unsigned short x = U2BE(G_io_apdu_buffer, 5);
        unsigned short y = U2BE(G_io_apdu_buffer, 7);
        unsigned short width = U2BE(G_io_apdu_buffer, 9);
        unsigned short height = U2BE(G_io_apdu_buffer, 11);
        unsigned short colors_count = G_io_apdu_buffer[13];
        // colors are LE encoded
        unsigned bit_per_pixel = 4;
        bagl_hal_draw_bitmap_within_rect(x, 
                                         y, 
                                         width, 
                                         height, 
                                         colors_count, 
                                         (unsigned int*)(G_io_apdu_buffer+14), // potentially unaligned // this is debugggg #yolo
                                         bit_per_pixel, 
                                         G_io_apdu_buffer+14+colors_count*4, 
                                         (rx - 5 - 9 - colors_count*4)*8);
        sw = 0x9000; goto error;
        break;
      }

      case INS_DRAW_BMP4BPP_CONTINUE: {
        bagl_hal_draw_bitmap_continue(4, G_io_apdu_buffer+5, (rx-5)*8);
        break;
      }
#endif // HAVE_DRAW

      case INS_RESET:
        flags |= IO_RESET_AFTER_REPLIED;
        sw = 0x9000; goto error;
        break;

      case INS_ECHO:
        tx = rx;
        sw = 0x9000; goto error;
        break;

      /*
      case INS_DUMP:
        #warning DUMP IS ACTIVATED
        if (G_io_apdu_buffer[APDU_OFF_LC] != 4+2) {
          sw = 0x6700; goto error;
        }
        // dump dump
        tx = MIN(256, U2BE(G_io_apdu_buffer, 9));
        os_memmove(G_io_apdu_buffer, U4BE(G_io_apdu_buffer, 5), tx);
        sw = 0x9000; goto error;
        break;
      */

      /*
      case 0x2:
        break;
      case 0x3:
        cx_des_init_key blablabla
        state = STATE_AUTH
        break;
      */

      // proceed to the secure instruction interpreter
      case INS_SECUINS:
        // retrieve data (all raw loader commands are case 2)
        rx = G_io_apdu_buffer[APDU_OFF_LC];

        // loader ID not yet presented
        if (state == STATE_ID) {
          sw = 0x6985 ; goto error;
        }

// SECURITY DEACTIVATED UNTIL CRYPTO IS READY
        
        switch(G_io_apdu_buffer[APDU_OFF_SECINS]) {
          // all data are ciphered with the issuer key, no data is trusted from the
          // SCP as the customer key could be compromised
          case SECUREINS_SELECT_SEGMENT: {
            if (rx != 1+4) {
              sw = 0x6700; goto error;
            }

            load_address = U4BE(G_io_apdu_buffer, 6);
            // nothing to output
            break; 
          }
          case SECUREINS_LOAD: {
            // at least offset (2 bytes) + 1 byte to patch + 1 byte instruction
            if (rx < 1+2+1) {
              sw = 0x6700; goto error;
            }


            unsigned int chunk_address = ((unsigned int)load_address + (unsigned int)U2BE(G_io_apdu_buffer, 6));

            // feil the session, won't accept further command
            if (chunk_address < &_eloadedtext) {
              sw = 0x6984; goto error;
            }

            // avoid loading when a code is ready for booting
            if (cx_crc16(&N_bootloader_configuration.appmain, sizeof(appmain_t)) == N_bootloader_configuration.crc) {
              bootloader_erase_appconf();
            }

            nvm_write((unsigned char const *)chunk_address, G_io_apdu_buffer+8, rx-3);
            break; 
          }
          case SECUREINS_FLUSH: {
            nvm_write_flush();
            break;
          }
          case SECUREINS_CRC: {
            if (rx != 1+2+4+2) {
              sw = 0x6700; goto error;
            }
            // check crc, OR security error
            if (cx_crc16((unsigned char const*)((unsigned int)load_address + (unsigned int)U2BE(G_io_apdu_buffer, 6)), U4BE(G_io_apdu_buffer, 8)) != U2BE(G_io_apdu_buffer, 12)) {
              sw = 0x6982; goto error;
            }
            break;
          }

