LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
          case SECUREINS_BOOT: {
            if (rx != 1+4) {
              sw = 0x6700; goto error;
            }

            union {
             bootloader_configuration_t ramconf;
             unsigned char page_remaining[NVM_PAGE_SIZE_B];
            } bootpage;
            memset(&bootpage, 0, NVM_PAGE_SIZE_B);

            // write the address of the main
            bootpage.ramconf.appmain = (appmain_t)U4BE(G_io_apdu_buffer, 6);
            // to be done in called code // ramconf.vtor = (appmain_t)U4BE(G_io_apdu_buffer, 6+4);

            // update the crc value
            bootpage.ramconf.crc = cx_crc16(&bootpage.ramconf.appmain, sizeof(appmain_t));
            // ensure page always filled with zeros, as per code signature generation (even if tearing during page)
            nvm_write(&N_bootloader_configuration, &bootpage, NVM_PAGE_SIZE_B);

            // ensure flushing the boot configuration into nvram
            nvm_write_flush();

            // from now on, the application can boot, boot now
            flags |= IO_RESET_AFTER_REPLIED;

            ///BEGIN WIPE STATE
            // invalidate the IV, make sure nothing can be validated after that
            os_memset(&(iv[0]), 0xFF, sizeof(iv));
            state = STATE_ID;
            ///END WIPE STATE
            break;
          }

          case SECUREINS_TESTBOOT: {
            if (rx != 1+4) {
              sw = 0x6700; goto error;
            }

            // start the code
            ((appmain_t)(U4BE(G_io_apdu_buffer, 6)))(0);
          }

          case SECUREINS_ERASE_BOOT: {
            if (cx_crc16(&N_bootloader_configuration.appmain, sizeof(appmain_t)) == N_bootloader_configuration.crc) {
              bootloader_erase_appconf();
            }
          }

          default:
            sw = 0x6D00; goto error;
            break;
        }
        // ok no problem
        sw = 0x9000; goto error;
        break;

      // ensure INS is empty otherwise (use secure instruction)
      default:
        sw = 0x6D00; goto error;
    }

  error:
    // Unexpected exception => security erase
    G_io_apdu_buffer[tx] = sw>>8;
    G_io_apdu_buffer[tx+1] = sw;
    tx += 2;
    // error detected !!
    if (sw != 0x9000) {
      ///BEGIN WIPE STATE
      // invalidate the IV, make sure nothing can be validated after that
      os_memset(&(iv[0]), 0xFF, sizeof(iv));
      state = STATE_ID;
      /// END WIPE STATE
    }

    // reply response apdu
    io_exchange(CHANNEL_APDU|flags|IO_RETURN_AFTER_TX, tx);
  }
}

void bootloader_delegate_boot(uint32_t button_press_duration) {

  // if boot address is valid, then boot it
  if (cx_crc16(&N_bootloader_configuration.appmain, sizeof(appmain_t)) == N_bootloader_configuration.crc) {

    // disable interruption before changing VTOR and delegate to application code
    __asm("cpsid i");

    // jump into the application code
    N_bootloader_configuration.appmain(button_press_duration);

    __asm("cpsid i");

    // jump failed (or loaded code returned) go to bootloader
    nvm_write_init();
    bootloader_erase_appconf();

    // ensure to reset the display of the bootloader prompt
    NVIC_SystemReset();
  }
}
#endif // HAVE_BL

void SystemClock_Config(void) {
  // TODO re apply the best clock scheme according to the current power mode
}

typedef struct bagl_element_e {
  bagl_component_t component;
  const char* text;
} bagl_element_t;


const bagl_element_t screen_boot_l4[] = {
  // type                                 id    x    y    w    h    s  r  fill       fg        bg        font                                                                                icon   text, out, over, touch
  // erase bootloader logo (center of screen)
  {{BAGL_ICON                           , 0x00, 109, 188, 101, 104, 0, 0, BAGL_FILL, 0,         0,          0                                                                                 , BAGL_GLYPH_LOGO_LEDGER_100  }, NULL},
  {{BAGL_LABEL                          , 0x00,   0, 438, 320,  14, 0, 0, BAGL_FILL, 0x999999, 0xF9F9F9, BAGL_FONT_OPEN_SANS_LIGHT_13px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0 }, "Version: " VERSION },
};

void display_l4_boot(void) {
  unsigned int i;

  for (i=0 ; i < sizeof(screen_boot_l4) / sizeof(bagl_element_t); i++) {
    unsigned char* text = screen_boot_l4[i].text;
    bagl_draw_with_context(&screen_boot_l4[i].component, text, text?strlen(text):0, text?BAGL_ENCODING_LATIN1:0);
  }
}

const bagl_element_t screen_mode_l4[] = {
  // type                                 id    x    y    w    h    s  r  fill       fg        bg        font                                                                                icon   text, out, over, touch
  // erase bootloader logo (center of screen)
  {{BAGL_RECTANGLE                      , 0x00, 109, 188, 101, 104, 0, 0, BAGL_FILL, 0xF9F9F9, 0xF9F9F9, 0                                                                                 , 0   }, NULL},

  // erase current mode selection (bottom of screen)
  {{BAGL_RECTANGLE                      , 0x00,   0, 455, 320,  25, 0, 0, BAGL_FILL, 0xF9F9F9, 0xF9F9F9, 0                                                                                 , 0   }, NULL },


  // test circle
  //{{BAGL_RECTANGLE                      , 0x00,  20,  80,  70,  70, 1,30, 0,         0x222222, 0xCCCCCC, 0                                                                                 , 0   }, NULL },

  // bootloader screen

  // title bar
  {{BAGL_RECTANGLE                      , 0x00,   0,   0, 320,  60, 0, 0, BAGL_FILL, 0x1d2028, 0x000000, 0                                                                                 , 0   }, NULL },
  {{BAGL_LABEL                          , 0x00,  19,  21, 260,  20, 0, 0, BAGL_FILL, 0xFFFFFF, 0x1d2028, BAGL_FONT_OPEN_SANS_LIGHT_16px|BAGL_FONT_ALIGNMENT_MIDDLE                         , 0   }, 1 },

  // logo
  {{BAGL_ICON                           , 0x00, 135, 163,  50,  50, 0, 0, BAGL_FILL, 0xCCCCCC, 0xF9F9F9, 0                                                                                 , BAGL_GLYPH_ICON_GEARS_50 } , NULL, },
  //{{BAGL_RECTANGLE | FLAG_COLORARRAY    , 0x00, 135, 163,  50,  50, 0, 0, BAGL_FILL,        4,        0, 0                                                                                     }, {0xCCCCCC, }, C_bitmaps[ICON_GEARS], NULL, NULL, NULL, NULL},


  {{BAGL_LABEL                          , 0x00,   0, 231, 320,  14, 0, 0, BAGL_FILL, 0x000000, 0xF9F9F9, BAGL_FONT_OPEN_SANS_BOLD_13px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0  }, 2 },
  {{BAGL_LABEL                          , 0x00,   0, 258, 320,  14, 0, 0, BAGL_FILL, 0x000000, 0xF9F9F9, BAGL_FONT_OPEN_SANS_LIGHT_13px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0 }, "No loaded firmware." },

  // for buttons, the background is the label color
//{{BAGL_RECTANGLE                      , 0x00,  90, 300, 140,  40, 0, 6, 0        , 0x41ccb4, 0xF9F9F9, 0                                                                                 , 0   }, NULL },
//{{BAGL_LABEL                          , 0x00,  90, 300, 140,  40, 0, 0, BAGL_FILL, 0xFFFFFF, 0x41ccb4, BAGL_FONT_OPEN_SANS_LIGHT_14px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0 }, "POWER OFF" },

  {{BAGL_LABEL                          , 0x00,   0, 438, 320,  14, 0, 0, BAGL_FILL, 0x999999, 0xF9F9F9, BAGL_FONT_OPEN_SANS_LIGHT_13px|BAGL_FONT_ALIGNMENT_CENTER|BAGL_FONT_ALIGNMENT_MIDDLE, 0 }, "Version: " VERSION},
};


