LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
unsigned char screen_mode_l4_string_buffer[32];

void display_l4_mode(unsigned char* title, unsigned char* msg) {
  unsigned int i;

  for (i=0 ; i < sizeof(screen_mode_l4) / sizeof(bagl_element_t); i++) {
    if (screen_mode_l4[i].text != NULL) {
      unsigned char* text;
      switch((unsigned int)screen_mode_l4[i].text) {
        case 1:
          // argument 1
          strcpy(screen_mode_l4_string_buffer, title);
          text = screen_mode_l4_string_buffer;
          break;
        case 2:
          // argument 2
          strcpy(screen_mode_l4_string_buffer, msg);
          text = screen_mode_l4_string_buffer;
          break;
        default:
          text = screen_mode_l4[i].text;
          break;
      }
      bagl_draw_with_context(&screen_mode_l4[i].component, text, strlen(text), BAGL_ENCODING_LATIN1);
    }
    else {
      bagl_draw(&screen_mode_l4[i].component);
    }
  }
}

void display_l4_mode_touch(void) {
  // button has been removed
  /*
  if (G_io_touch.ts_last_x >= 80 
    && G_io_touch.ts_last_x <= 80+160
    && G_io_touch.ts_last_y >= 290
    && G_io_touch.ts_last_y <= 290+60) {
    harakiri();
  }
  */
}

void io_seproxyhal_check_no_command_status(void) {
  // consume any residual data in RX, we can't possibly have received multiples tags when starting a reply.
  while (io_seproxyhal_rx_available()) {
    unsigned char buff[300]; // sorry stack
    io_seproxyhal_recv(buff, sizeof(buff));
    if (G_io_button.link_debug) {
      screen_printf("Unexpected data: %.*H\n", (buff[1]<<8)|(buff[2]&0xFF), buff);
    }
  }
}

extern unsigned int g_pfnVectors;
extern unsigned int g_pfnVectors_copy;

extern unsigned int _etext;
extern unsigned int  _data;
extern unsigned int  _edata;
extern unsigned int  _bss;
extern unsigned int  _ebss;
extern unsigned int  _estack;

void main(unsigned int button_press_duration)
{ 
  GPIO_InitTypeDef GPIO_InitStruct;

#ifdef HAVE_BL
  /* FPU settings ------------------------------------------------------------*/
  #if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
    SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));  /* set CP10 and CP11 Full Access */
  #endif
  /* Reset the RCC clock configuration to the default reset state ------------*/
  /* Set MSION bit */
  RCC->CR |= RCC_CR_MSION;

  frequency_hz = 4000000;

  /* Reset CFGR register */
  RCC->CFGR = 0x00000000;

  /* Reset HSEON, CSSON , HSION, and PLLON bits */
  RCC->CR &= (uint32_t)0xEAF6FFFF;

  /* Reset PLLCFGR register */
  RCC->PLLCFGR = 0x00000800;

  /* Reset HSEBYP bit */
  RCC->CR &= (uint32_t)0xFFFBFFFF;

  /* Disable all interrupts */
  RCC->CIER = 0x00000000;


  G_io_button.displayed_mode = 0;
  G_io_button.pressed = 0;
  G_io_button.duration_ms = 0; 
  G_io_ble.powered = 0;

  #ifdef DEBUG_BUTTON_LINK_DEBUG
  G_io_button.link_debug = DEBUG_BUTTON_LINK_DEBUG_INITIAL;
  #endif // DEBUG_BUTTON_LINK_DEBUG


  __asm("cpsie i");

  // loop forever (in the final version)
  // TODO wait until power button to wake up all subsys (only activate sys wakeup 2 and power off everything then deep sleep.
  
  
  /* Configure the system clock */
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  __PWR_CLK_ENABLE();
  __SYSCFG_CLK_ENABLE(); 

  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  __GPIOA_CLK_ENABLE();
  // backlight full off during screen init to avoid blink
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);

  __GPIOC_CLK_ENABLE();
  /* PC9 AUX_PWR_enable, PC8 button_enable */
  GPIO_InitStruct.Pin = GPIO_PIN_9|GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  // keep power on
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, 1);

  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, 0); 
  
  clock_config();


  // low powering the whole chip by disabling all possible boot pull resistors
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9/*|GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14*/ /*|GPIO_PIN_15*/;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  __GPIOB_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  __GPIOC_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|/*GPIO_PIN_8|GPIO_PIN_9|*/GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  __GPIOD_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  __GPIOH_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  clock_high();

  // sort out interrupt priority to avoid complete lockup
  HAL_NVIC_SetPriority(OTG_FS_IRQn, 3, 0);
  HAL_NVIC_SetPriority(PendSV_IRQn, 3, 0);
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 2, 0);
  HAL_NVIC_SetPriority(BNRG_SPI_EXTI_IRQn, 2, 0);
  HAL_NVIC_SetPriority(EXTI3_IRQn, 2, 0);
  HAL_NVIC_SetPriority(EXTI2_IRQn, 2, 0);
  HAL_NVIC_SetPriority(SysTick_IRQn, 1, 0);
  HAL_NVIC_SetPriority(USART1_IRQn, 0, 0); // avoid overrun error on the SE iso link when receiving

  // initialize the button press duration
  // button_it configuration for press delay determination
  GPIO_InitStruct.Pin =  GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  //GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
#ifdef DEBUG_BUTTON_NOT_REQUIRED_FOR_POWER_ON
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#endif
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);  

  // enable detection of release (in case releasing after power off duration)
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);

  // start the ticker for the tsc to work correctly (warning ARM hal set the systick prio !!)
  G_io_seproxyhal_ticker_current_ms = 0;
  G_io_seproxyhal_ticker_enabled = 0;
  G_battery_test_ms = 0;
  G_watchdog_ms = 0;
  G_poweroff_ms = 0;
  G_backlight_autooff_ms = 0;
  G_backlight_autodim_ms = 0;
  SYSTICK_power(1);

  // pwr
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, 1);

  // initialize screen session and charge pump, but no disoplay yet
  screen_init(0);
  
  G_io_button.boot_moment = 1;
  G_io_button.duration_ms = 0; // approx
  G_io_button.displayed_mode = MODE_BOOT;
  G_io_button.pressed = 1; // fake pressed (booting means pressed)

