LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
  // wait until button it is released (or the last click length has been reached)
  while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_2) && ! (G_io_button.displayed_mode & MODE_POWER_OFF)) {
    if (G_io_button.duration_ms >= BUTTON_PRESS_DURATION_BOOT_POWER_ON 
      && !(G_io_button.displayed_mode & MODE_POWER_ON)) {

      // display boot screen as the delay is ok
      display_l4_boot();

      // only lit screen when logo is on screen
      screen_on();

      /* Peripheral clock enable */
      __TIM2_CLK_ENABLE();

      screen_brightness(BACKLIGHT_FULL_LEVEL);

      /**TIM2 GPIO Configuration    
      PA15     ------> TIM2_CH1 
      */
      GPIO_InitStruct.Pin = GPIO_PIN_15;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
      GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
      //HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

      G_io_button.displayed_mode |= MODE_POWER_ON;
    }
  }

#if defined(DEBUG_BUTTON_NEVER_PUSHED) || defined (DEBUG_BUTTON_NOT_REQUIRED_FOR_POWER_ON)

  // display boot screen as the delay is ok
  display_l4_boot();

  // only lit screen when logo is on screen
  screen_on();

  /* Peripheral clock enable */
  __TIM2_CLK_ENABLE();

  screen_brightness(BACKLIGHT_FULL_LEVEL);

  /**TIM2 GPIO Configuration    
  PA15     ------> TIM2_CH1 
  */
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
  //HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, 0);
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  G_io_button.displayed_mode |= MODE_POWER_ON;

#else // DEBUG_BUTTON_NOT_REQUIRED_FOR_POWER_ON

  // power off if not pushed long enough,
  if (!(G_io_button.displayed_mode & MODE_POWER_ON)) {
    harakiri();
  }
#endif // DEBUG_BUTTON_NEVER_PUSHED || DEBUG_BUTTON_NOT_REQUIRED_FOR_POWER_ON

  G_io_button.pressed = 0;
  G_io_button.boot_moment = 0;

#ifdef DEMO_LOGO
  G_io_button.displayed_mode = 0;
  for(;;);
#endif

  /*
  if (!SE_iso_power(1)) {
    // try to power up the SE, if we cannot, then stay in loader (special patch for nicolas)
    G_io_button.displayed_mode = MODE_MCU_BOOTLOADER;
  }
  SE_iso_power(0);
  */

  __asm("cpsid i");
  // power on for short and medium press
  if (/*BUTTON_PRESS_DURATION_CTRL_BOOTLOADER != 0xFFFFFFFFUL use a nvram struct for these params (with antitearing)
    && */
    (G_io_button.duration_ms < BUTTON_PRESS_DURATION_BOOT_CTRL_BOOTLOADER
#ifdef DEBUG_BUTTON_FLASHBACK
    && ! (G_io_button.displayed_mode & MODE_SE_FLASHBACK)
#endif // DEBUG_BUTTON_FLASHBACK
    && ! (G_io_button.displayed_mode & MODE_MCU_BOOTLOADER))
#ifdef DEBUG_BUTTON_ALWAYS_PUSHED
    || (G_io_button.displayed_mode & MODE_POWER_OFF) 
#endif // DEBUG_BUTTON_ALWAYS_PUSHED
    ) {
    G_io_apdu_protocol_enabled = 0;
    G_io_button.displayed_mode = 0;

    __asm("cpsie i");

    // delegate by default (with indication of the timing for recovery/standard boot as the info is lost after delegation)
    bootloader_delegate_boot(G_io_button.duration_ms);

  }
  // else long press stays in L4 bootloader mode

  __asm("cpsid i");

#else 
  // reset button state in seproxyhal (not bootloader) mode
  G_io_button.boot_moment = 0;
  G_io_button.pressed = 0;
  G_io_button.displayed_mode = 0;
  #ifdef DEBUG_BUTTON_LINK_DEBUG
  G_io_button.link_debug = DEBUG_BUTTON_LINK_DEBUG_INITIAL;
  #endif // DEBUG_BUTTON_LINK_DEBUG


  __asm("cpsid i");
  //clock_config(); // to setup frequency_hz, strangely it cannot be done ;( it seems like systicks becomes crazy after ward
  frequency_hz = 48000000;
#endif // HAVE_BL

  __asm("cpsie i");

  G_seproxyhal_event_timeout_enable = 0;

//#define SCREEN_TEST_AT_BOOT
#ifdef SCREEN_TEST_AT_BOOT

  /*
  {
    unsigned char buffer[32];
    HAL_I2C_Master_Receive(&hi2c, MSG2133_I2C_ADDR, buffer, 8, 1024);  // no timeout
  }
  */


  #ifdef DEMO_BAGL
  demo_bagl();
  #endif // DEMO_BAGL
  
  /*
  screen_printf("Test\nString\n value ");
  screen_printf("azertyuiopqsdfghjklmwxcvbn,;:!?./????*%%??12345678901234567890)=??+~#{[|`\\^$@]}ABCDEFGHIJKLMNOPQRSTUVWXYZ\n%04d\nBOOT SCREEN TEST\n",2763);
  
  screen_printf("%.*H\n", 8, g_pcHex);
  */
  // force refresh and close screen session
  PRINTF("Ledger $lue\n");

#endif // SCREEN_TEST_AT_BOOT

  // test arm semihosting printf("FROM STM32L4\n");

reboot:

  // initialize screen session and charge pump
  screen_init(1);
  // modify screen "image"  
  screen_clear();


#ifdef HAVE_BL

  G_io_apdu_protocol_enabled = 1;
  
  HAL_Delay(500);

  display_l4_mode("Ledger Blue", "BOOTLOADER MODE");

  /* Init Device Library */
  USBD_Init(&USBD_Device, &HID_Desc, 0);
  
  /* Register the HID class */
  USBD_RegisterClass(&USBD_Device, &USBD_CUSTOM_HID);

  USBD_CUSTOM_HID_RegisterInterface(&USBD_Device, &USBD_CustomHID_template_fops);
  
  /* Start Device Process */
  USBD_Start(&USBD_Device);

  // run the bootloader main
  bootloader_apdu_interp();

#else
  // default is BLE/USB managed asynch by the SE
  G_io_apdu_protocol_enabled = 0;
 
  BLE_power(0, NULL); 
  //KBD_power(0);
  // enable the UI
  //UI_led_power(0);
  //UI_power(1);

  //clock_config();

  PRINTF("Power up ST31\n");

  // USART test with hsi clock
  // open iso clock
  SE_iso_power(1);

  PRINTF("ATR: %.*H\n", 20, G_io_se_atr);

  // ATR for ST31 Ledger BL/BOLOS
  if (G_io_se_atr_length != 5) {   

    const char recovery_name [] = {AD_TYPE_COMPLETE_LOCAL_NAME,'L','e','d','g','e','r',' ', 'B','l','u','e', ' ','F','A','B','\0'};
    // request standard ISO apdu transport between the SE and the MCU instead of raw SPI packet (to save overhead)
    G_io_apdu_protocol_enabled = 1;

#ifdef HAVE_BLE_MCU
    // ######### ENABLE BLE TRANSPORT
    // await for BLE connection to process APDU through ST ISO bootloader
    //BLE_power(0, recovery_name);

    BLE_power(1, recovery_name);
#endif // HAVE_BLE_MCU

