LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
    HAL_Delay(500);
    display_l4_mode("Ledger Blue FAB", "MANUFACTURER MODE");

    // ######### ENABLE USB TRANSPORT
    /* Init Device Library */
    USBD_Init(&USBD_Device, &HID_Desc, 0);
    /* Register the HID class */
    USBD_RegisterClass(&USBD_Device, &USBD_CUSTOM_HID);
    USBD_CUSTOM_HID_RegisterInterface(&USBD_Device, &USBD_CustomHID_template_fops);
    /* Start Device Process */
    USBD_Start(&USBD_Device);
    io_usb_hid_init();


    while(1) {

#ifdef HAVE_BLE_MCU
      // stop ble upon disconnection
      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BLE_DISCONNECT) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_BLE_DISCONNECT;
        
        BLE_power(0, NULL);
        BLE_power(1, recovery_name); 
      }
#endif // HAVE_BLE_MCU

      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BUTTON) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_BUTTON;

        // push event is not userful but for awakening
        backlight_enable(1);
      }
	  
      screen_update_touch_event();
      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_TOUCH) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_TOUCH;
        PRINTF("TT. ");
      }

      if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_RELEASE) {
        G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_RELEASE;

        // undim
        if (backlight_is_enabled()) {
          backlight_enable(1);
        }

        display_l4_mode_touch();
      }

#ifdef HAVE_BLE_MCU
      // check for an apdu via ble
      if (G_io_ble.apdu_available) {
        backlight_enable(1);

        // consume apdu availability under critical section
        __asm("cpsid i");
        G_io_ble.apdu_available = 0;
        __asm("cpsie i");
        __asm volatile ("nop"); 
        __asm volatile ("nop"); 

        // special reset command
        if (G_io_apdu_buffer[0] == 0xFE
          && G_io_apdu_buffer[1] == 0xFE
          && G_io_apdu_buffer[2] == 0xFE
          && G_io_apdu_buffer[3] == 0xFE) {
          G_io_apdu_buffer[0] = 0x90;
          G_io_apdu_buffer[1] = 0x00;
          BLE_protocol_send(G_io_apdu_buffer, 2);
          // just in case
          for (;;) {
            NVIC_SystemReset();
          }
        }
      
        // process and reply the apdu  
        BLE_protocol_send(G_io_apdu_buffer, SE_iso_exchange_apdu(G_io_apdu_buffer, G_io_ble.apdu_length)); 
        
        // process ble activity if any
        if (HCI_require_processing()) {
          SCB->ICSR |= 1<<28;
        }
      }
#endif // HAVE_BLE_MCU

      // check for an apdu via usb
      if ((io_exchange(CHANNEL_APDU, 0))) {

        backlight_enable(1);

        // special reset command
        if (G_io_apdu_buffer[0] == 0xFE
          && G_io_apdu_buffer[1] == 0xFE
          && G_io_apdu_buffer[2] == 0xFE
          && G_io_apdu_buffer[3] == 0xFE) {
          G_io_apdu_buffer[0] = 0x90;
          G_io_apdu_buffer[1] = 0x00;
          io_exchange(CHANNEL_APDU|IO_RETURN_AFTER_TX|IO_RESET_AFTER_REPLIED, 2);
          // just in case
          for (;;) {
            NVIC_SystemReset();
          }
        }
        io_exchange(CHANNEL_APDU|IO_RETURN_AFTER_TX, SE_iso_exchange_apdu(G_io_apdu_buffer, G_io_apdu_length));
      }
    }

    // reset the chip to check out the new ATR
    NVIC_SystemReset();
  }

  // Small delay for baudrate to be taken into account in the SE
  HAL_Delay(2);

  // session start the SE
  G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_SESSION_START_EVENT;
  G_io_seproxyhal_buffer[1] = 0;
  G_io_seproxyhal_buffer[2] = 1+4+1+sizeof(VERSION);
  // ask SE recovery when button press is longer than the required delay
#ifdef FORCE_ST31_RECOVERY
  G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_SESSION_START_EVENT_RECOVERY; 
#else
  G_io_seproxyhal_buffer[3] = button_press_duration >= BUTTON_PRESS_DURATION_BOOT_SE_RECOVERY ? SEPROXYHAL_TAG_SESSION_START_EVENT_RECOVERY:0;
#endif
#ifdef FORCE_ST31_BACK_TO_STLOADER
  G_io_seproxyhal_buffer[3] = 4;
#endif // FORCE_ST31_BACK_TO_STLOADER
#ifdef DEBUG_BUTTON_FLASHBACK
  // flashback asked
  if (G_io_button.displayed_mode & MODE_SE_FLASHBACK || button_press_duration >= BUTTON_PRESS_DURATION_BOOT_SE_FLASHBACK) {
    G_io_seproxyhal_buffer[3] |= 4;
  }
#endif // DEBUG_BUTTON_FLASHBACK
#ifdef DEBUG_BUTTON_ALWAYS_PUSHED
  G_io_seproxyhal_buffer[3] = 0;
#endif // DEBUG_BUTTON_ALWAYS_PUSHED


  // compute the feature flags
  unsigned int features = 0
                        | SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_USB
#ifndef NANOS_DEVKIT
#ifdef HAVE_BLE
                        | SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_BLE         
#endif // HAVE_BLE
                        | SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_TOUCH       
                        | SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_SCREEN_BIG
#else // NANOS_DEVKIT
                        | SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_SCREEN_SML
#endif // NANOS_DEVKIT
                        | (1<<SEPROXYHAL_TAG_SESSION_START_EVENT_FEATURE_BUTTON_COUNT_POS)
                        ;
  G_io_seproxyhal_buffer[4] = (features>>24);
  G_io_seproxyhal_buffer[5] = (features>>16);
  G_io_seproxyhal_buffer[6] = (features>>8);
  G_io_seproxyhal_buffer[7] = (features>>0);

  // version
  G_io_seproxyhal_buffer[8] = sizeof(VERSION);
  memcpy(G_io_seproxyhal_buffer+8+1, VERSION, sizeof(VERSION));

  io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3+1+4+1+sizeof(VERSION));
  G_io_seproxyhal_state = WAIT_COMMAND;

  volatile unsigned short rx;
  volatile unsigned short tx;
  volatile unsigned int i;
  volatile unsigned int l;
  volatile unsigned int x,y;

#ifdef IO_USB_HID
  io_usb_hid_init();
#endif // IO_USB_HID

  union {
    bagl_component_t c;
    unsigned char raw[128];
  } bagl_e;
  unsigned int bagl_l;

  // init unsecure firm signature check
  G_io_unsec_chunk.offset = 0;
  USBD_Device.pData = NULL;

  for(;;) {     
    switch (G_io_seproxyhal_state) {
      case WAIT_EVENT:

        // check if any message is comming from the SE, it is unexpected but for printf

