LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
        // avoid polling, stay low power
        rx = io_seproxyhal_rx_available();
        if (rx >= 3) {
          // receive tlv header
          rx = io_seproxyhal_recv(G_io_seproxyhal_buffer, sizeof(G_io_seproxyhal_buffer));
          l = (G_io_seproxyhal_buffer[1]<<8)|(G_io_seproxyhal_buffer[2]&0xFF);

          // reset power off, a new command has been received (even if not expected)
          backlight_enable(1);
		  
          switch(G_io_seproxyhal_buffer[0]) {
            default:
              #ifdef DEBUG_BUTTON_LINK_DEBUG
              if (G_io_button.link_debug) {
                screen_printf("unexpected tlv: %.*H\n", MIN(l+3, 256), G_io_seproxyhal_buffer);
              }
              #endif // DEBUG_BUTTON_LINK_DEBUG
              break;

            // interpret printf within wait event, for easier debug of hardfault on the SE 
            // side (and of various invalid protocol handling)
            case SEPROXYHAL_TAG_PRINTF_STATUS: {
              unsigned char* pc = &G_io_seproxyhal_buffer[3];
              //poor's man printf pipe
              while(l--) {
                screen_printc(*pc++);
              }
              // printf ok
              G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_DISPLAY_PROCESSED_EVENT;
              G_io_seproxyhal_buffer[1] = 0;
              G_io_seproxyhal_buffer[2] = 0;

              io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
              break;
            }
          }
        }

#ifdef HAVE_TOUCHPANEL
        // check for touch events (i2c touchscreen is somewhat interacting with usart)
        screen_update_touch_event();
#endif // HAVE_TOUCHPANEL

        // ready to send the next incoming event (BLE/NFC/TOUCH/WATCHDOG/USB etc)
        if (G_io_seproxyhal_events) {

          // whatever the event, usb transfer can't take place behind the SE to avoid spurious hardware race that alter the SE replied bytes
          HAL_NVIC_DisableIRQ(OTG_FS_IRQn);
        
          volatile unsigned int consumed_events = 0;
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_SET_LINK_SPEED) {
            // change speed
            SE_set_link_speed(G_io_se_link_next_mhz, G_io_se_link_next_etu);

            // add some delay ?? for SE to setup the new link speed
            consumed_events = SEPROXYHAL_EVENT_SET_LINK_SPEED;
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;  
          }
          // power off
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_WATCHDOG) {
            // VERY OVERPOWERED => chlik !chlak
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_UNSEC_CHUNK) {
            #define UNSEC_TOTAL_LENGTH (&_esignature-&_signed)
            #define UNSEC_SIGNED_LENGTH (&_esigned-&_signed)

#ifdef TEST_WRONG_MCU_SIGNATURE
              G_io_unsec_chunk.size = 0x24;
#endif

            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_UNSEC_CHUNK_EVENT;
            G_io_seproxyhal_buffer[1] = G_io_unsec_chunk.size>>8;
            G_io_seproxyhal_buffer[2] = G_io_unsec_chunk.size;

            // send in 2 packets
            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);

            // first packet encode the total length on a U4BE
            if (G_io_unsec_chunk.offset==0) {
              G_io_unsec_chunk.size-=4;
#ifdef TEST_WRONG_MCU_SIGNATURE
              G_io_unsec_chunk.size = 0x20;
#else
              G_io_seproxyhal_buffer[0] = UNSEC_SIGNED_LENGTH>>24;
              G_io_seproxyhal_buffer[1] = UNSEC_SIGNED_LENGTH>>16;
              G_io_seproxyhal_buffer[2] = UNSEC_SIGNED_LENGTH>>8;
              G_io_seproxyhal_buffer[3] = UNSEC_SIGNED_LENGTH;
#endif
              io_seproxyhal_send(G_io_seproxyhal_buffer, 4);
            }

            if (G_io_unsec_chunk.size) {
              io_seproxyhal_send((void*)(((unsigned int)&_signed)+G_io_unsec_chunk.offset), G_io_unsec_chunk.size);
            }

            // prepare next chunk if any
            G_io_unsec_chunk.offset+=G_io_unsec_chunk.size;

            consumed_events = SEPROXYHAL_EVENT_UNSEC_CHUNK;
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;            
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BLE_WRITE) {
            //PRINTF("BW. ");
            // forge BLE packet to the SE
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_BLUENRG_RECV_EVENT;
            G_io_seproxyhal_buffer[1] = (G_io_ble.bluenrg_buffer_size)>>8;
            G_io_seproxyhal_buffer[2] = (G_io_ble.bluenrg_buffer_size);

            // send in 2 packets
            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            #ifdef DEBUG_BUTTON_LINK_DEBUG
            if (G_io_button.link_debug >= 2) {
              screen_printf("> %.*H\n", G_io_ble.bluenrg_buffer_size, G_io_ble.bluenrg_buffer);
            }
            #endif // DEBUG_BUTTON_LINK_DEBUG
            io_seproxyhal_send(G_io_ble.bluenrg_buffer, G_io_ble.bluenrg_buffer_size);

        
            // switch to command state until the SE replies a general status
            G_io_seproxyhal_state = WAIT_COMMAND;
            
            // avoid packet race (consumed after the next one is received => missing next packet)
            __asm("cpsid i");
            G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_BLE_WRITE;
            __asm("cpsie i");

            // consume the forwarded packet, and retrieve the next one if any available.
            BlueNRG_Consumed();
            goto consumed;
          }

          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_RESET) {
            //PRINTF("UR. ");
            consumed_events = SEPROXYHAL_EVENT_USB_RESET;
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 1;
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_USB_EVENT_RESET;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 4);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SUSPENDED) {
            //PRINTF("US. ");
            consumed_events = SEPROXYHAL_EVENT_USB_SUSPENDED;
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 1;
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_USB_EVENT_SUSPENDED;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 4);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_RESUMED) {
            //PRINTF("UP. ");
            consumed_events = SEPROXYHAL_EVENT_USB_RESUMED;
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 1;
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_USB_EVENT_RESUMED;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 4);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SETUP) {
            //PRINTF("UT. ");
            consumed_events = SEPROXYHAL_EVENT_USB_SETUP;

            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EP_XFER_EVENT;
            G_io_seproxyhal_buffer[1] = (3+8)>>8;
            G_io_seproxyhal_buffer[2] = (3+8);
            G_io_seproxyhal_buffer[3] = 0;
            G_io_seproxyhal_buffer[4] = SEPROXYHAL_TAG_USB_EP_XFER_SETUP;
            G_io_seproxyhal_buffer[5] = 8;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 6);
            io_seproxyhal_send(hpcd_USB_OTG_FS.Setup, 8);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_XFER_IN) {
            unsigned char epnum;
            //PRINTF("UX. ");
            // process in before out to ensure device holds the DoS way
            if (G_io_usb.ep_in) {
              for (epnum=0; epnum<MAX_USB_BIDIR_ENDPOINTS; epnum++) {
                if (G_io_usb.ep_in & (1<<epnum)) {
                  G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EP_XFER_EVENT;
                  G_io_seproxyhal_buffer[1] = (3)>>8;
                  G_io_seproxyhal_buffer[2] = (3);
                  G_io_seproxyhal_buffer[3] = epnum|0x80;
                  G_io_seproxyhal_buffer[4] = SEPROXYHAL_TAG_USB_EP_XFER_IN;
                  G_io_seproxyhal_buffer[5] = G_io_usb.ep_in_len[epnum];

                  io_seproxyhal_send_start(G_io_seproxyhal_buffer, 6);
                  G_io_seproxyhal_state = WAIT_COMMAND;

                  __asm("cpsid i");
                  G_io_usb.ep_in &= ~(1<<epnum);
                  if (!G_io_usb.ep_in) {
                    G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_USB_XFER_IN;
                  }
                  __asm("cpsie i");
                  goto consumed;
                }
              }
            }
            // nothing to be done, consume the event
            consumed_events = SEPROXYHAL_EVENT_USB_XFER_OUT;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_XFER_OUT) {
            unsigned char epnum;
            if (G_io_usb.ep_out) {
              for (epnum=0; epnum<MAX_USB_BIDIR_ENDPOINTS; epnum++) {
                if (G_io_usb.ep_out & (1<<epnum)) {
                  unsigned char len = G_io_usb.ep_out_len[epnum];
                  G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EP_XFER_EVENT;
                  G_io_seproxyhal_buffer[1] = (3+len)>>8;
                  G_io_seproxyhal_buffer[2] = (3+len);
                  G_io_seproxyhal_buffer[3] = epnum;
                  G_io_seproxyhal_buffer[4] = SEPROXYHAL_TAG_USB_EP_XFER_OUT;
                  G_io_seproxyhal_buffer[5] = len;

                  io_seproxyhal_send_start(G_io_seproxyhal_buffer, 6);
                  // xfer_buff is incremented
                  io_seproxyhal_send(G_io_usb.ep_out_buff[epnum], 
                                     len);
 
                  G_io_seproxyhal_state = WAIT_COMMAND;
                  __asm("cpsid i");
                  G_io_usb.ep_out &= ~(1<<epnum);
                  if (!G_io_usb.ep_out) {
                    G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_USB_XFER_OUT;
                  }
                  __asm("cpsie i");
                  goto consumed;
                }
              }
            }
            // nothing to be done, consume the event
            consumed_events = SEPROXYHAL_EVENT_USB_XFER_OUT;
            goto consume;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SOF) {
            consumed_events = SEPROXYHAL_EVENT_USB_SOF;
            /*
            //PRINTF("UF. ");
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_USB_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 1
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_USB_EVENT_SOF;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 4);
            G_io_seproxyhal_state = WAIT_COMMAND;
            */
            goto consume;
          }

          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BUTTON) {

            // when button is clicked, don't send to the SE when the backlight was off, just awake
            if (!backlight_is_enabled()) {
              backlight_enable(1);
            }
            else {
              G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_BUTTON_PUSH_EVENT;
              G_io_seproxyhal_buffer[1] = 0;
              G_io_seproxyhal_buffer[2] = 1;
//              G_io_seproxyhal_buffer[3] = (G_io_button.duration_ms >= SEPROXYHAL_LONG_BUTTON_PUSH_MS)?1:0;
              G_io_seproxyhal_buffer[3] = (G_io_button.pressed << 1); // send the pressed button mask
              io_seproxyhal_send_start(G_io_seproxyhal_buffer, 4);
              G_io_seproxyhal_state = WAIT_COMMAND;
            }
            consumed_events = SEPROXYHAL_EVENT_BUTTON;
            goto consume;
          }

#ifdef HAVE_TOUCHPANEL
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_RELEASE) {
            consumed_events = SEPROXYHAL_EVENT_RELEASE;
           
