LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
            // avoid clicking anywhere, user must use the button to awake from sleep
            if (!backlight_is_enabled()) {
              goto consume_nowakeup;
            }

            //PRINTF("TR. ");
            x = G_io_touch.ts_last_x;
            y = G_io_touch.ts_last_y;
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_FINGER_EVENT_RELEASE;
            // consume x&y to avoid multiple touch release (thanks SUPERB touchscreen impl)
            G_io_touch.ts_last_x = -1;
            G_io_touch.ts_last_y = -1;
            goto send_finger_event;
          }
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_TOUCH) {
            consumed_events = SEPROXYHAL_EVENT_TOUCH;
           
            // avoid clicking anywhere, user must use the button to awake from sleep
            if (!backlight_is_enabled()) {
              goto consume_nowakeup;
            }

            //PRINTF("TT. ");
            x = G_io_touch.ts_last_x;
            y = G_io_touch.ts_last_y;
            G_io_seproxyhal_buffer[3] = SEPROXYHAL_TAG_FINGER_EVENT_TOUCH;
          send_finger_event:
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_FINGER_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 5;
            // [3] already set
            G_io_seproxyhal_buffer[4] = x>>8;
            G_io_seproxyhal_buffer[5] = x;
            G_io_seproxyhal_buffer[6] = y>>8;
            G_io_seproxyhal_buffer[7] = y;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 8);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }
#endif // HAVE_TOUCHPANEL

#ifdef ASYNCH_DISPLAY_PROCESSED_EVENT
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_DISPLAYED) {
            consumed_events = SEPROXYHAL_EVENT_DISPLAYED;
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_DISPLAY_PROCESSED_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 0; 

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            G_io_seproxyhal_state = WAIT_COMMAND;
            goto consume;
          }

#endif // ASYNCH_DISPLAY_PROCESSED_EVENT

          // last to avoid overflowing io events with a too short ticker
          if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_TICKER) {
            //PRINTF("TI. ");
            consumed_events = SEPROXYHAL_EVENT_TICKER;
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_TICKER_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 0; 

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            G_io_seproxyhal_state = WAIT_COMMAND_TICKER;
            goto consume;
          }


          // no event to be consumed
          break;

        consume_nowakeup:
          __asm("cpsid i");
          G_io_seproxyhal_events &= ~consumed_events;
          __asm("cpsie i");
          break;

        consume:
          __asm("cpsid i");
          G_io_seproxyhal_events &= ~consumed_events;
          __asm("cpsie i");
        consumed:
          // reset power off, an event command has been received
          backlight_enable(1);
        }
        break;

      case WAIT_BLE_READ_DATA:
      case WAIT_COMMAND:
      case WAIT_COMMAND_TICKER:
        // avoid polling, stay low power
        rx = io_seproxyhal_rx_available();

        // discard invalid replies
        if (rx < 3) {
          // nothing to do yet
          break;
        }
        // receive tlv header
        rx = io_seproxyhal_recv(G_io_seproxyhal_buffer, sizeof(G_io_seproxyhal_buffer));
        l = (G_io_seproxyhal_buffer[1]<<8)|(G_io_seproxyhal_buffer[2]&0xFF);

        // only reset timeout when receiving a command, to give more time before the status
        G_seproxyhal_event_timeout = 0;

        // reset power off, a new command has been received
        backlight_enable(1);

#ifdef DEBUG_BUTTON_LINK_DEBUG
        if (G_io_button.link_debug >= 2 && G_io_seproxyhal_state != WAIT_COMMAND_TICKER) {
          screen_printf("< %.*H\n", MIN(l+3, 256), G_io_seproxyhal_buffer);
        }
#endif // DEBUG_BUTTON_LINK_DEBUG

        switch(G_io_seproxyhal_buffer[0]) {
          case SEPROXYHAL_TAG_BLE_RADIO_POWER:
            PRINTF("BO. ");
            // turn BLE ON or OFF, use the last defined service. (make discoverable)
            BLE_power(G_io_seproxyhal_buffer[3]&0x2, NULL); // if not advertising, then don't turn on

            /*
            if (G_io_seproxyhal_buffer[3]&0x02) {
              while (BlueNRG_SPI_Read_All(G_io_seproxyhal_buffer, sizeof(G_io_seproxyhal_buffer)) == 0);
            }
            */
            if (G_io_seproxyhal_buffer[3]&0x02) {
              // wait until EVT_BLUE_INITIALIZED which ends up the BLUENRG initialization
              while (!G_io_ble.bluenrg_buffer_size);
              // consume it
              __asm("cpsid i");
              G_io_seproxyhal_events &= ~SEPROXYHAL_EVENT_BLE_WRITE;
              G_io_ble.bluenrg_buffer_size = 0;
              __asm("cpsie i");
            }
            break;
          case SEPROXYHAL_TAG_BLUENRG_SEND: {
            // for the first packet, it's mandatory
            unsigned char ble_write_retry = 3;
            // CS_flag = G_io_seproxyhal_buffer[3]; // (in case splitting packet)
            // send the frame to the BLUENRG
            while (BlueNRG_SPI_Write(G_io_seproxyhal_buffer+4, NULL, l-1, 0) != 0 && ble_write_retry--) {
              // error ? => reply won't come ! that's it
            }

            // stay in command mode (a display could be issued afterwards)
            break;
          }
          case SEPROXYHAL_TAG_SCREEN_POWER:
            // TODO PWN off
            break;
          case SEPROXYHAL_TAG_MORE_TIME:
            // TODO add watchdog time
            break;

          case SEPROXYHAL_TAG_SE_POWER_OFF:
          case SEPROXYHAL_TAG_DEVICE_OFF:
            harakiri();
            break;

          case SEPROXYHAL_TAG_SET_TICKER_INTERVAL: {
            PRINTF("TK ");
            if (l == 2) { 
              // ticker interval ms in U2BE
              G_io_seproxyhal_ticker_interval_ms = (G_io_seproxyhal_buffer[3]<<8)|(G_io_seproxyhal_buffer[4]&0xFF);
              // when interval is 0 then ticker is disabled
              G_io_seproxyhal_ticker_enabled = (G_io_seproxyhal_ticker_interval_ms != 0);
              G_io_seproxyhal_ticker_current_ms = 0; // reset interval
            }
            break;
          }

