LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
          case SEPROXYHAL_TAG_PRINTF_STATUS: {
            unsigned char* pc = &G_io_seproxyhal_buffer[3];
            //poor's man printf pipe
            while(l--) {
              screen_printc(*pc++);
            }
            // printf ok
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_DISPLAY_PROCESSED_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 0;

            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            // stay in command mode
            break;
          }

          case SEPROXYHAL_TAG_SCREEN_DISPLAY_STATUS: {
            //PRINTF("CD. ");
            if (l < sizeof(bagl_component_t)) {
              PRINTF("INVALID");
              // too short packet
              break;
            }

            // check last display value to avoid blink without support in the application
            if (l != bagl_l 
              || memcmp(&bagl_e, &G_io_seproxyhal_buffer[3], MIN(sizeof(bagl_e), l)) != 0) {

              // little endian to little endian, cross finger and hope for same fields alignment
              memcpy(&bagl_e, &G_io_seproxyhal_buffer[3], MIN(sizeof(bagl_e), l));

#ifdef NANOS_DEVKIT
              bagl_e.c.x += 16;
              bagl_e.c.y += 16;
#endif

              bagl_l = l;

#ifdef HAVE_BLE_MCU
              // magic replace if necessary
              if (((l - sizeof(bagl_component_t)) >= sizeof(ESC_DEVICE_NAME) - 1) && 
                  (memcmp(&G_io_seproxyhal_buffer[3+sizeof(bagl_component_t)], ESC_DEVICE_NAME, sizeof(ESC_DEVICE_NAME) - 1) == 0)) {
                if (G_io_ble.powered) {
                  bagl_draw_with_context(&bagl_e.c, G_io_ble.last_discovered_name + 1, strlen(G_io_ble.last_discovered_name + 1), BAGL_ENCODING_LATIN1);
                } else {
                  bagl_draw_with_context(&bagl_e.c, DEVICE_NAME_NA, strlen(DEVICE_NAME_NA), BAGL_ENCODING_LATIN1);                
                }
              }
              else 
#endif // HAVE_BLE_MCU
              {
                bagl_draw_with_context(&bagl_e.c, &G_io_seproxyhal_buffer[3+sizeof(bagl_component_t)], l-sizeof(bagl_component_t), BAGL_ENCODING_LATIN1);
              }
            }           
            #ifdef ASYNCH_DISPLAY_PROCESSED_EVENT
            __asm("cpsid i");
            G_io_seproxyhal_events |= SEPROXYHAL_EVENT_DISPLAYED;
            __asm("cpsie i");
            G_io_seproxyhal_state = WAIT_EVENT;
            #else // ASYNCH_DISPLAY_PROCESSED_EVENT
            // reply display processed event
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_DISPLAY_PROCESSED_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 0;
            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            #endif // ASYNCH_DISPLAY_PROCESSED_EVENT
            // stay in command state
            break;
          }
          
          case SEPROXYHAL_TAG_SCREEN_ANIMATION_STATUS: {
            // nothing to animate, consider it done
              
            #ifdef ASYNCH_DISPLAY_PROCESSED_EVENT
            __asm("cpsid i");
            G_io_seproxyhal_events |= SEPROXYHAL_EVENT_DISPLAYED;
            __asm("cpsie i");
            G_io_seproxyhal_state = WAIT_EVENT;
            #else // ASYNCH_DISPLAY_PROCESSED_EVENT
            // reply display processed event
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_DISPLAY_PROCESSED_EVENT;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 0;
            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 3);
            #endif // ASYNCH_DISPLAY_PROCESSED_EVENT
            // stay in command state
            break;
          }
          

          case SEPROXYHAL_TAG_GENERAL_STATUS:
            //PRINTF("END ");
            if (l == 2) {
              switch((G_io_seproxyhal_buffer[3]<<8)|(G_io_seproxyhal_buffer[4]&0xFF)) {
                case SEPROXYHAL_TAG_GENERAL_STATUS_LAST_COMMAND:

                  // Reenable OTG fs interrupt to perform requested USB transmit if any.
                  // this workaround the hardware race between usart and otg.
                  HAL_NVIC_EnableIRQ(OTG_FS_IRQn);

                  G_io_seproxyhal_state = WAIT_EVENT;
                  G_seproxyhal_event_timeout_enable = 0;
                  break;
                /*
                case SEPROXYHAL_TAG_GENERAL_STATUS_MORE_COMMAND:
                  // card has replied and is indicating it will be speaking later on
                  G_seproxyhal_event_timeout_enable = 0;
                */
                default:
                  // remain in wait command
                  break;
              }
            }
            break;

          // disable to remove USB support (on STM32L4 nucleo for example)
          case SEPROXYHAL_TAG_USB_CONFIG:
            switch (G_io_seproxyhal_buffer[3]) {

              case SEPROXYHAL_TAG_USB_CONFIG_CONNECT:
                // already done at boot // clock_config();

                // startup the low level usb stack
                USBD_Device.pClass = NULL;
                USBD_Device.pData = NULL;
                USBD_LL_Init(&USBD_Device);
                USBD_LL_Start(&USBD_Device);

                // enable usb interrupt
                //HAL_NVIC_EnableIRQ(OTG_FS_IRQn);
                break;
              case SEPROXYHAL_TAG_USB_CONFIG_DISCONNECT:
                if (USBD_Device.pData){
                  USBD_LL_Stop(&USBD_Device); 
                }
                break;
              case SEPROXYHAL_TAG_USB_CONFIG_ADDR:
                if (USBD_Device.pData){
                  USBD_LL_SetUSBAddress(&USBD_Device, G_io_seproxyhal_buffer[4]);
                }
                break;
              case SEPROXYHAL_TAG_USB_CONFIG_ENDPOINTS:
                if (USBD_Device.pData){
                  // configure all endpoints
                  for(l=0;l<G_io_seproxyhal_buffer[4];l++) {
                    if (G_io_seproxyhal_buffer[5+l*3+1] == SEPROXYHAL_TAG_USB_CONFIG_TYPE_DISABLED) {
                      // still skip the other bytes
                      USBD_LL_CloseEP(&USBD_Device, G_io_seproxyhal_buffer[5+l*3]);
                    }
                    else {
                      uint8_t ep_type = -1;
                      switch(G_io_seproxyhal_buffer[5+l*3+1]) {
                        case SEPROXYHAL_TAG_USB_CONFIG_TYPE_CONTROL:
                          ep_type = USBD_EP_TYPE_CTRL;
                          break;
                        case SEPROXYHAL_TAG_USB_CONFIG_TYPE_ISOCHRONOUS:
                          ep_type = USBD_EP_TYPE_ISOC;
                          break;
                        case SEPROXYHAL_TAG_USB_CONFIG_TYPE_BULK:
                          ep_type = USBD_EP_TYPE_BULK;
                          break;
                        case SEPROXYHAL_TAG_USB_CONFIG_TYPE_INTERRUPT:
                          ep_type = USBD_EP_TYPE_INTR;
                          break;
                      }
                      USBD_LL_OpenEP(&USBD_Device, 
                                     G_io_seproxyhal_buffer[5+l*3], 
                                     ep_type, 
                                     G_io_seproxyhal_buffer[5+l*3+2]);
                    }
                  }
                }
                break;
            }
            break;

          case SEPROXYHAL_TAG_USB_EP_PREPARE:
            if (USBD_Device.pData){
              switch (G_io_seproxyhal_buffer[4]) { 
                case SEPROXYHAL_TAG_USB_EP_PREPARE_DIR_UNSTALL:
                  USBD_LL_ClearStallEP(&USBD_Device, G_io_seproxyhal_buffer[3]);
                  break;

                case SEPROXYHAL_TAG_USB_EP_PREPARE_DIR_STALL:
                  USBD_LL_StallEP(&USBD_Device, G_io_seproxyhal_buffer[3]);
                  break;

                case SEPROXYHAL_TAG_USB_EP_PREPARE_DIR_IN:
                  USBD_LL_Transmit(&USBD_Device, 
                                   G_io_seproxyhal_buffer[3], 
                                   G_io_seproxyhal_buffer+6, 
                                   G_io_seproxyhal_buffer[5]);
                  break;

                case SEPROXYHAL_TAG_USB_EP_PREPARE_DIR_SETUP:
                case SEPROXYHAL_TAG_USB_EP_PREPARE_DIR_OUT:
                  USBD_LL_PrepareReceive(&USBD_Device, 
                                         G_io_seproxyhal_buffer[3], 
                                         (G_io_seproxyhal_buffer[5]>MAX_USB_ENDPOINT_SIZE?MAX_USB_ENDPOINT_SIZE:G_io_seproxyhal_buffer[5]));
                  break;
              }
            }
            break;

#ifdef SEPROXYHAL_TAG_MCU_BOOTLOADER
          case SEPROXYHAL_TAG_MCU_BOOTLOADER:
            // return to bootloader, permanently
            return;
#endif // SEPROXYHAL_TAG_MCU_BOOTLOADER

