LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/main.c
          case SEPROXYHAL_TAG_UNSEC_CHUNK_READ:
            // reset the unsec offset read if requested
            if (G_io_seproxyhal_buffer[5]) {
              G_io_unsec_chunk.offset = 0;
            }

            // | vector | bootloader | [gap] | seproxyhal | signature |
            // ^_signed                      ^ _text      ^_esigned   ^_esignature
            G_io_unsec_chunk.size = MIN((&_esignature-&_signed)-G_io_unsec_chunk.offset, 
                                        (G_io_seproxyhal_buffer[3]<<8) | G_io_seproxyhal_buffer[4]);
										
            // prepare async event after get status
            __asm("cpsid i");
            G_io_seproxyhal_events |= SEPROXYHAL_EVENT_UNSEC_CHUNK;
            __asm("cpsie i");
            break;

          case SEPROXYHAL_TAG_SET_LINK_SPEED: {
            unsigned int mhz = G_io_seproxyhal_buffer[3];
            unsigned int etu = G_io_seproxyhal_buffer[4];

            // ack speed change
            G_io_seproxyhal_buffer[0] = SEPROXYHAL_TAG_ACK_LINK_SPEED;
            G_io_seproxyhal_buffer[1] = 0;
            G_io_seproxyhal_buffer[2] = 3;
            // unchanged since recv // G_io_seproxyhal_buffer[3] = mhz;
            // unchanged since recv // G_io_seproxyhal_buffer[4] = etu;
            //G_io_seproxyhal_buffer[3] = 12; // force mhz
            //G_io_seproxyhal_buffer[4] = 8; // force etu
            if (l == 2) {
              G_io_seproxyhal_buffer[5] = 1; //ACK

              G_io_se_link_next_mhz = mhz;
              G_io_se_link_next_etu = etu;

              __asm("cpsid i");
              G_io_seproxyhal_events |= SEPROXYHAL_EVENT_SET_LINK_SPEED;
              __asm("cpsie i");
            }
            else {
              G_io_seproxyhal_buffer[5] = 0; //NACK
            }
            io_seproxyhal_send_start(G_io_seproxyhal_buffer, 6);
            G_io_seproxyhal_state = WAIT_EVENT;
            G_seproxyhal_event_timeout_enable = 0;
            break;
          }
        }
        break;
    }
  }

  #endif // HAVE_BL

  // shall never be reached
  NVIC_SystemReset();
}


void io_seproxyhal_send_start(unsigned char * buffer, unsigned short length) {
  // reset command timeout detection
  G_seproxyhal_event_timeout = 0;
  G_seproxyhal_event_timeout_enable = 1;
  memmove(G_seproxyhal_event_timeout_header, buffer, 3);
#ifdef DEBUG_BUTTON_LINK_DEBUG
  // don't display ticker event to avoid log pollution
  if (G_io_button.link_debug >= 2 && buffer[0] != SEPROXYHAL_TAG_TICKER_EVENT) {
    screen_printf("> %.*H\n", MIN(length, 256), buffer);
  }
#endif // DEBUG_BUTTON_LINK_DEBUG

  io_seproxyhal_check_no_command_status();

  io_seproxyhal_send(buffer, length);
}

/**
 * @}
 */

/**
 * @}
 */

